kamien1/kamien1.tex
% Created 2023-04-15 Sat 18:15
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{placeholder}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={placeholder},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.0.50 (Org mode 9.6.1)}, 
 pdflang={English}}
\begin{document}

\begin{center}
\begin{tabular}{|l|l|}
\hline
\multicolumn{2}{|l|}{Politechnika Świętokrzyska w Kielcach} \\
\multicolumn{2}{|l|}{Wydział Elektrotechniki,Automatyki I Informatyki} \\
\hline
\multicolumn{2}{|l|}{Podstawy Programownaia 2 - Projekt} \\
\multicolumn{2}{|l|}{Informatyka - I Rok akademicki 2022/2023} \\
\hline
Temat Projektu: & Wykonali: \\
Wypożyczalnia Samochodów & 1. Rafał Grot \\
 & 2. Kamil Gunia \\
 & 3. Jakub Grzelec \\
 & 4. Karina Goszczyńska \\
\hline
\end{tabular}
\end{center}
\section{Pierwszy kamień milowy}
\label{sec:orgf6fd683}
\subsection{Opanowanie systemu kotroli wersji \texttt{git}.}
\label{sec:org891ad85}
Mogło być lepiej ale damy radę.
\subsection{Podział pracy w zespole.}
\label{sec:org19c92bf}
Mogło być lepiej ale damy radę.
\subsection{Projekt relacyjniej bazy danych samochodów, klientów, wypożyczeń.}
\label{sec:orge93f163}
Jest.
\subsection{Zapoznanie się z biblioteką \texttt{sqlite} \url{https://www.sqlite.org} ,nauka tworzenia i wykonwywania porstych kwerend za jej pomocą.}
\label{sec:org174c2b2}
Mogło być lepiej ale damy radę.
\subsection{Wstępna implementacja interfejsu użytkownia.}
\label{sec:org63a08c5}
Jest.
\subsection{Testowanie poprawności działania menu.}
\label{sec:orgf304710}
Działa.
\subsection{Przygotowanie sprawozdania z postępów prac nad projektem.}
\label{sec:org2331809}
Jest.
\subsection{Podsumowanie co się udało/nie udało}
\label{sec:org614b39f}
Jest powyżej.
Dodatkowo połowa zespołu opanowała Doxygen oraz podstawy biblioteki \texttt{ncurses}.
Została napisana implementacja podwójnie linkowanej listy.
\section{Drugi kamień milowy}
\label{sec:org90a07bf}
\begin{enumerate}
\item Implementacja bazy danych.
\item Implementacja dodawania, usuwania oraz modyfikacji -- Samochodów i kilentów.
\item Implementacja wypożyczania i oddawania samochodów
\item Wyświetlanie samochodów z możliwością sortowania rosnącego/malejącego.
\item podsumowanie
\end{enumerate}
\section{I termin}
\label{sec:org13fc20f}
\begin{enumerate}
\item Stworzenie dokumentacji w porgramie \texttt{Doxygen}
\item Sporządzenie sprawodzania.
\item Dodanie ewentualnych ulepszeń.
\end{enumerate}
\end{document}